# groupby 메서드로 평균값 구하기

In [42]:
import pandas as pd

In [43]:
df=pd.read_csv("C:\\Github\\Pandas\\doit\\data\\gapminder.tsv",sep="\t")
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [44]:
avg_life_exp_by_year=df.groupby('year').lifeExp.mean()
(avg_life_exp_by_year)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

# 분할-반영-결합 과정 살펴보기

In [45]:
years=df.year.unique()
years

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [46]:
y1952=df.loc[df.year==1952,:]
y1952

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [47]:
Angola=df.loc[df.country=='Angola',:]
Angola

   country continent  year  lifeExp       pop    gdpPercap
36  Angola    Africa  1952   30.015   4232095  3520.610273
37  Angola    Africa  1957   31.999   4561361  3827.940465
38  Angola    Africa  1962   34.000   4826015  4269.276742
39  Angola    Africa  1967   35.985   5247469  5522.776375
40  Angola    Africa  1972   37.928   5894858  5473.288005
41  Angola    Africa  1977   39.483   6162675  3008.647355
42  Angola    Africa  1982   39.942   7016384  2756.953672
43  Angola    Africa  1987   39.906   7874230  2430.208311
44  Angola    Africa  1992   40.647   8735988  2627.845685
45  Angola    Africa  1997   40.963   9875024  2277.140884
46  Angola    Africa  2002   41.003  10866106  2773.287312
47  Angola    Africa  2007   42.731  12420476  4797.231267

In [48]:
y1952_mean=y1952.lifeExp.mean()
print(y1952_mean)

49.05761971830987

In [49]:
y1957=df.loc[df.year==1957,:]
y1957_mean=y1957.lifeExp.mean()
y1957_mean

51.50740112676054

In [50]:
df2=pd.DataFrame({'year':[1952,1957],
                 "":[y1952_mean,y1957_mean]})
df2

   year
0  1952  49.057620
1  1957  51.507401

In [51]:
df.groupby('year').count()

      country  continent  lifeExp  pop  gdpPercap
year
1952      142        142      142  142        142
1957      142        142      142  142        142
1962      142        142      142  142        142
1967      142        142      142  142        142
1972      142        142      142  142        142
1977      142        142      142  142        142
1982      142        142      142  142        142
1987      142        142      142  142        142
1992      142        142      142  142        142
1997      142        142      142  142        142
2002      142        142      142  142        142
2007      142        142      142  142        142

In [52]:
df.groupby('year').size()

year
1952    142
1957    142
1962    142
1967    142
1972    142
1977    142
1982    142
1987    142
1992    142
1997    142
2002    142
2007    142
dtype: int64

In [53]:
df.groupby('year').mean()

        lifeExp           pop     gdpPercap
year
1952  49.057620  1.695040e+07   3725.276046
1957  51.507401  1.876341e+07   4299.408345
1962  53.609249  2.042101e+07   4725.812342
1967  55.678290  2.265830e+07   5483.653047
1972  57.647386  2.518998e+07   6770.082815
1977  59.570157  2.767638e+07   7313.166421
1982  61.533197  3.020730e+07   7518.901673
1987  63.212613  3.303857e+07   7900.920218
1992  64.160338  3.599092e+07   8158.608521
1997  65.014676  3.883947e+07   9090.175363
2002  65.694923  4.145759e+07   9917.848365
2007  67.007423  4.402122e+07  11680.071820

In [54]:
df.groupby('year').std()

        lifeExp           pop     gdpPercap
year
1952  12.225956  5.810086e+07   9321.064786
1957  12.231286  6.550429e+07   9869.662202
1962  12.097245  6.978865e+07   8667.362525
1967  11.718858  7.837548e+07   8095.315431
1972  11.381953  8.864682e+07  10614.383403
1977  11.227229  9.748109e+07   8362.489150
1982  10.770618  1.050986e+08   7733.845006
1987  10.556285  1.147562e+08   8288.281304
1992  11.227380  1.245026e+08   9031.846080
1997  11.559439  1.334174e+08  10171.493263
2002  12.279823  1.408483e+08  11154.114865
2007  12.073021  1.476214e+08  12859.937337

In [55]:
df.groupby('year').min()

          country continent  lifeExp     pop   gdpPercap
year
1952  Afghanistan    Africa   28.801   60011  298.846212
1957  Afghanistan    Africa   30.332   61325  335.997115
1962  Afghanistan    Africa   31.997   65345  355.203227
1967  Afghanistan    Africa   34.020   70787  349.000000
1972  Afghanistan    Africa   35.400   76595  357.000000
1977  Afghanistan    Africa   31.220   86796  371.000000
1982  Afghanistan    Africa   38.445   98593  424.000000
1987  Afghanistan    Africa   39.906  110812  385.000000
1992  Afghanistan    Africa   23.599  125911  347.000000
1997  Afghanistan    Africa   36.087  145608  312.188423
2002  Afghanistan    Africa   39.193  170372  241.165877
2007  Afghanistan    Africa   39.613  199579  277.551859

In [59]:
df.groupby('year').lifeExp.quantile(q=0.5)

year
1952    45.1355
1957    48.3605
1962    50.8810
1967    53.8250
1972    56.5300
1977    59.6720
1982    62.4415
1987    65.8340
1992    67.7030
1997    69.3940
2002    70.8255
2007    71.9355
Name: lifeExp, dtype: float64

In [57]:
df.lifeExp.quantile(q=0.75)

70.8455

In [64]:
df3=pd.DataFrame({"a":[1,2,3,4]})
df3

   a
0  1
1  2
2  3
3  4

In [67]:
df3.mean()

a    2.5
dtype: float64

In [71]:
df3.quantile(q=1)

a    4.0
Name: 1, dtype: float64

In [73]:
df.groupby('year').first()

          country continent  lifeExp       pop   gdpPercap
year
1952  Afghanistan      Asia   28.801   8425333  779.445314
1957  Afghanistan      Asia   30.332   9240934  820.853030
1962  Afghanistan      Asia   31.997  10267083  853.100710
1967  Afghanistan      Asia   34.020  11537966  836.197138
1972  Afghanistan      Asia   36.088  13079460  739.981106
1977  Afghanistan      Asia   38.438  14880372  786.113360
1982  Afghanistan      Asia   39.854  12881816  978.011439
1987  Afghanistan      Asia   40.822  13867957  852.395945
1992  Afghanistan      Asia   41.674  16317921  649.341395
1997  Afghanistan      Asia   41.763  22227415  635.341351
2002  Afghanistan      Asia   42.129  25268405  726.734055
2007  Afghanistan      Asia   43.828  31889923  974.580338

In [76]:
df.groupby('year').lifeExp.nth(n=2)

year
1952    43.077
1957    45.685
1962    48.303
1967    51.407
1972    54.518
1977    58.014
1982    61.368
1987    65.799
1992    67.744
1997    69.152
2002    70.994
2007    72.301
Name: lifeExp, dtype: float64

# 평균값을 구하는 사용자 함수와 groupby 메서드

In [79]:
def my_mean(values):
    n=len(values)
    sum=0
    for value in values:
        sum +=value
    return sum/n

In [80]:
agg_my_mean=df.groupby('year').lifeExp.agg(my_mean)
print(agg_my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

# 두 개의 인잣값을 받아 처리하는 사용자 함수와 groupby 메서드

In [88]:
def my_mean_diff(values, diff_value):
    n=len(values)
    sum=0
    for value in values:
        sum+=value
    mean=sum/n
    return mean-diff_value

In [89]:
global_mean=df.lifeExp.mean()
global_mean

59.47443936619713

In [92]:
agg_mean_diff=df.groupby('year').lifeExp.agg(my_mean_diff,diff_value=global_mean)
agg_mean_diff

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

# 집계 메서드를 리스트, 딕셔너리에 담아 전달하기

In [94]:
import numpy as np

In [97]:
gdf=df.groupby('year').lifeExp.agg([np.count_nonzero,np.mean,np.std])
gdf

      count_nonzero       mean        std
year
1952          142.0  49.057620  12.225956
1957          142.0  51.507401  12.231286
1962          142.0  53.609249  12.097245
1967          142.0  55.678290  11.718858
1972          142.0  57.647386  11.381953
1977          142.0  59.570157  11.227229
1982          142.0  61.533197  10.770618
1987          142.0  63.212613  10.556285
1992          142.0  64.160338  11.227380
1997          142.0  65.014676  11.559439
2002          142.0  65.694923  12.279823
2007          142.0  67.007423  12.073021

In [98]:
df.groupby('year').lifeExp.agg(np.count_nonzero)

year
1952    142.0
1957    142.0
1962    142.0
1967    142.0
1972    142.0
1977    142.0
1982    142.0
1987    142.0
1992    142.0
1997    142.0
2002    142.0
2007    142.0
Name: lifeExp, dtype: float64

In [100]:
gdf_dic=df.groupby('year').agg({'lifeExp':'mean','pop':'median','gdpPercap':'median'})
gdf_dic

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334741
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371109

# 표준 점수 계산하기

In [103]:
def my_zscore(x):
    return (x-x.mean())/x.std()

In [106]:
transform_z=df.groupby('year').lifeExp.apply(my_zscore)
transform_z

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [108]:
df.shape

(1704, 6)

In [109]:
transform_z.shape

(1704,)

# 누락값을 평균값으로 처리하기

In [110]:
import seaborn as sns
import numpy as np

In [114]:
np.random.seed(42)
tips_10=sns.load_dataset('tips').sample(10)
tips_10.loc[np.random.permutation(tips_10.index)[:4],'total_bill']=np.NaN
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153         NaN  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198         NaN  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [115]:
count_sex=tips_10.groupby('sex').count()
count_sex

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [116]:
def fill_na_mean(x):
    avg=x.mean()
    return x.fillna(avg)

In [118]:
total_bill_group_mean=tips_10.groupby('sex').total_bill.transform(fill_na_mean)
tips_10['fill_total_bill']=total_bill_group_mean
tips_10

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
24        19.82  3.18    Male     No   Sat  Dinner     2          19.8200
6          8.77  2.00    Male     No   Sun  Dinner     2           8.7700
153         NaN  2.00    Male     No   Sun  Dinner     4          17.9525
211         NaN  5.16    Male    Yes   Sat  Dinner     4          17.9525
198         NaN  2.00  Female    Yes  Thur   Lunch     2          13.9300
176         NaN  2.00    Male    Yes   Sun  Dinner     2          17.9525
192       28.44  2.56    Male    Yes  Thur   Lunch     2          28.4400
124       12.48  2.52  Female     No  Thur   Lunch     2          12.4800
9         14.78  3.23    Male     No   Sun  Dinner     2          14.7800
101       15.38  3.00  Female    Yes   Fri  Dinner     2          15.3800

# 데이터 필터링 사용하기 ─ filter 메서드

In [119]:
tips=sns.load_dataset('tips')
tips.shape

(244, 7)

In [120]:
tips['size'].value_counts()

2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64

In [121]:
tips_filtered=tips.\
groupby('size').\
filter(lambda x:x['size'].count()>=30)

In [123]:
tips_filtered.shape

(231, 7)

In [124]:
tips_filtered['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

# 그룹 오브젝트 저장하여 살펴보기

In [127]:
tips_10=sns.load_dataset('tips').sample(10,random_state=42)
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [128]:
grouped=tips_10.groupby('sex')
grouped

In [129]:
print(grouped.groups)

{'Male': Int64Index([24, 6, 153, 211, 176, 192, 9], dtype='int64'), 'Female': Int64Index([198, 124, 101], dtype='int64')}

# 그룹 오브젝트의 평균 구하기

In [130]:
avgs=grouped.mean()
avgs

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [131]:
tips_10.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

# 그룹 오브젝트에서 데이터 추출하고 반복하기

In [132]:
female=grouped.get_group('Female')
female

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [134]:
for sex_group in grouped:
    print(sex_group)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [142]:
for sex_group in grouped:
    print('the type is:{}\n'.format(type(sex_group)))
    print('the length ls:{}\n'.format(len(sex_group)))
    first_element=sex_group[0]
    print('the first element is:{}\n'.format(first_element))
    print('it has a type of: {}\n'.format(type(sex_group[0])))
    second_element=sex_group[1]
    print('the second element is: \n{}\n'.format(second_element))
    print('it has a type of: {}\n'.format(type(second_element)))
    print('what we have:')
    print(sex_group)
    break

the type is:<class 'tuple'>

the length ls:2

the first element is:Male

it has a type of: <class 'str'>

the second element is:
     total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2

it has a type of: <class 'pandas.core.frame.DataFrame'>

what we have:
('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)

# 그룹 오브젝트 계산하고 살펴보기

In [143]:
bill_sex_time=tips_10.groupby(['sex','time'])
group_avg=bill_sex_time.mean()
group_avg

               total_bill       tip      size
sex    time
Male   Lunch    28.440000  2.560000  2.000000
       Dinner   18.616667  2.928333  2.666667
Female Lunch    12.740000  2.260000  2.000000
       Dinner   15.380000  3.000000  2.000000

In [146]:
type(bill_sex_time)

pandas.core.groupby.generic.DataFrameGroupBy

In [144]:
type(group_avg)

pandas.core.frame.DataFrame

In [145]:
group_avg.columns

Index(['total_bill', 'tip', 'size'], dtype='object')

In [148]:
print(group_avg.index)

MultiIndex([(  'Male',  'Lunch'),
            (  'Male', 'Dinner'),
            ('Female',  'Lunch'),
            ('Female', 'Dinner')],
           names=['sex', 'time'])

In [150]:
group_method=tips_10.groupby(['sex','time']).mean().reset_index()
group_method

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [151]:
group_param=tips_10.groupby(['sex','time'],as_index=False).mean()
group_param

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [164]:
group_avg.iloc[0:2,:]

             total_bill       tip      size
sex  time
Male Lunch    28.440000  2.560000  2.000000
     Dinner   18.616667  2.928333  2.666667

In [168]:
group_avg.loc['Male',:]

        total_bill       tip      size
time
Lunch    28.440000  2.560000  2.000000
Dinner   18.616667  2.928333  2.666667